import { Order } from "@/types/search";
import { type ClassValue, clsx } from "clsx"
import { twMerge } from "tailwind-merge"
 
export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs))
}


export const DAYSFILTER = [
  { label: "من 5 إلى 9 أيام", value: "t1",period:[5,6,7,8,9] },
   { label: "من 10 إلى 12 أيام", value: "t2",period:[10,11,12]  },
    { label: "من 13 إلى 24 يوم", value: "t3",period:[13,14,15,16,17,18,19,20,21,22,23,24]  },
 
]

export const COUNTIRESLIST = [
   "الصين", "اليابان", "الهند", "كوريا الجنوبية", "فيتنام", "تايلاند", "إندونيسيا", "ماليزيا", "باكستان", "نيبال", "بنغلاديش", "سريلانكا", "بوتان", "منغوليا", "كازاخستان",
    "أوزبكستان", "قيرغيزستان", "طاجيكستان", "أفغانستان", "إيران", "العراق", "المملكة العربية السعودية", "تركيا", "إسرائيل", "الأردن", "لبنان", 
    "الإمارات العربية المتحدة", "قطر", "عمان", "الكويت"
   ,"المملكة المتحدة", "ألمانيا", "فرنسا", "إيطاليا", "إسبانيا", "هولندا", "بلجيكا", "سويسرا", "السويد", "النرويج", "الدنمارك", "فنلندا", "روسيا",
    "بولندا", "اليونان", "التشيك", "النمسا", "المجر", "البرتغال", "رومانيا", "بلغاريا", "كرواتيا", "أوكرانيا"
 ,"نيجيريا", "مصر", "جنوب إفريقيا", "كينيا", "غانا", "المغرب", "تونس", "إثيوبيا", "تنزانيا", "أوغندا", "الجزائر", "مالي", "السنغال",
  "النيجر", "الكاميرون", "ساحل العاج", "أنغولا", "مدغشقر", "رواندا", "موريشيوس"
 , "الولايات المتحدة", "كندا", "المكسيك", "جامايكا", "كوستاريكا", "بنما", "غواتيمالا", "هندوراس", "السلفادور", "نيكاراغوا", "بليز"
,  "البرازيل", "الأرجنتين", "تشيلي", "بيرو", "كولومبيا", "فنزويلا", "الإكوادور", "بوليفيا", "باراغواي", "أوروغواي"
   , "أستراليا", "نيوزيلندا", "بابوا نيو غينيا", "فيجي", "ساموا", "تونغا", "جزر سليمان", "فانواتو", "ميكرونيزيا", "بالاو", "جزر مارشال"
];

export const ORDERFILTER =[
   {
     label:"الأقل سعراَ",
     value:"price_double",
     order:Order.ASC
   },
    {
     label:"الأعلى سعراً",
     value:"price_double",
     order:Order.DESC
   },
    {
     label:"الأطول مدة",
     value:"number_of_days",
     order:Order.DESC
   },
     {
     label:"الأقل مدة",
     value:"number_of_days",
     order:Order.ASC
   },
 ]